#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.networking.data.aws_availability_zones.available: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.kubernetes.google_container_cluster.cluster will be created
  + resource "google_container_cluster" "cluster" {
      + additional_zones            = (known after apply)
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west2"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + min_master_version          = "1.16.13-gke.1"
      + monitoring_service          = (known after apply)
      + name                        = "kubernetes-v01-gke"
      + network                     = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + region                      = (known after apply)
      + remove_default_node_pool    = true
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "multi-cloud-gcp-subnet"
      + zone                        = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = "10.13.0.0/16"
          + cluster_secondary_range_name  = (known after apply)
          + node_ipv4_cidr_block          = (known after apply)
          + services_ipv4_cidr_block      = "10.14.0.0/16"
          + services_secondary_range_name = (known after apply)
          + subnetwork_name               = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)
          + password               = (sensitive value)
          + username               = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + network_policy {
          + enabled  = (known after apply)
          + provider = (known after apply)
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + pod_security_policy_config {
          + enabled = (known after apply)
        }
    }

  # module.kubernetes.google_container_node_pool.shared_e2_preemptible_pool[0] will be created
  + resource "google_container_node_pool" "shared_e2_preemptible_pool" {
      + cluster             = "kubernetes-v01-gke"
      + id                  = (known after apply)
      + initial_node_count  = (known after apply)
      + instance_group_urls = (known after apply)
      + location            = "europe-west2"
      + max_pods_per_node   = (known after apply)
      + name                = "e2-shared-preemptible"
      + name_prefix         = (known after apply)
      + node_count          = 1
      + node_locations      = (known after apply)
      + project             = (known after apply)
      + region              = (known after apply)
      + version             = (known after apply)
      + zone                = (known after apply)

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = (known after apply)
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.logging.aws_cloudwatch_log_group.vpc_flow_log will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "FlowLogForVPC"
      + retention_in_days = 0
    }

  # module.logging.aws_flow_log.flow_log_to_s3 will be created
  + resource "aws_flow_log" "flow_log_to_s3" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.logging.aws_flow_log.vpc_flow_log will be created
  + resource "aws_flow_log" "vpc_flow_log" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.logging.aws_iam_role.vpc_flow_log will be created
  + resource "aws_iam_role" "vpc_flow_log" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "FlowLogForVPC"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.logging.aws_iam_role_policy.vpc_flow_log will be created
  + resource "aws_iam_role_policy" "vpc_flow_log" {
      + id     = (known after apply)
      + name   = "FlowLogForVPC"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.logging.aws_s3_bucket.vpc_flow_log will be created
  + resource "aws_s3_bucket" "vpc_flow_log" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "rytswd-get-multi-cloud-k8s-v01-vpc-log"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.networking.data.aws_availability_zones.available will be read during apply
  # (config refers to values not yet known)
 <= data "aws_availability_zones" "available"  {
        group_names = [
            "eu-west-2",
        ]
      ~ id          = "2020-08-19 21:19:55.848460372 +0000 UTC" -> "2020-08-19 21:19:57.351250915 +0000 UTC"
        names       = [
            "eu-west-2a",
            "eu-west-2b",
            "eu-west-2c",
        ]
        zone_ids    = [
            "euw2-az2",
            "euw2-az3",
            "euw2-az1",
        ]
    }

  # module.networking.aws_subnet.multi_cloud_aws[0] will be created
  + resource "aws_subnet" "multi_cloud_aws" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.22.0.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.multi_cloud_aws[1] will be created
  + resource "aws_subnet" "multi_cloud_aws" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.22.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.multi_cloud_aws[2] will be created
  + resource "aws_subnet" "multi_cloud_aws" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.22.64.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_vpc.multi_cloud_aws will be created
  + resource "aws_vpc" "multi_cloud_aws" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.22.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
    }

  # module.networking.google_compute_network.multi_cloud_gcp will be created
  + resource "google_compute_network" "multi_cloud_gcp" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "multi-cloud-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.networking.google_compute_subnetwork.multi_cloud_gcp_subnet will be created
  + resource "google_compute_subnetwork" "multi_cloud_gcp_subnet" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.12.0.0/16"
      + name               = "multi-cloud-gcp-subnet"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = (known after apply)
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # module.vpn.aws_customer_gateway.customer_gateway_1 will be created
  + resource "aws_customer_gateway" "customer_gateway_1" {
      + arn        = (known after apply)
      + bgp_asn    = "65020"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + type       = "ipsec.1"
    }

  # module.vpn.aws_customer_gateway.customer_gateway_2 will be created
  + resource "aws_customer_gateway" "customer_gateway_2" {
      + arn        = (known after apply)
      + bgp_asn    = "65020"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + type       = "ipsec.1"
    }

  # module.vpn.aws_vpn_connection.cx_1 will be created
  + resource "aws_vpn_connection" "cx_1" {
      + arn                            = (known after apply)
      + customer_gateway_configuration = (known after apply)
      + customer_gateway_id            = (known after apply)
      + id                             = (known after apply)
      + routes                         = (known after apply)
      + static_routes_only             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + tunnel1_address                = (known after apply)
      + tunnel1_bgp_asn                = (known after apply)
      + tunnel1_bgp_holdtime           = (known after apply)
      + tunnel1_cgw_inside_address     = (known after apply)
      + tunnel1_inside_cidr            = "169.254.10.4/30"
      + tunnel1_preshared_key          = (sensitive value)
      + tunnel1_vgw_inside_address     = (known after apply)
      + tunnel2_address                = (known after apply)
      + tunnel2_bgp_asn                = (known after apply)
      + tunnel2_bgp_holdtime           = (known after apply)
      + tunnel2_cgw_inside_address     = (known after apply)
      + tunnel2_inside_cidr            = "169.254.10.8/30"
      + tunnel2_preshared_key          = (sensitive value)
      + tunnel2_vgw_inside_address     = (known after apply)
      + type                           = "ipsec.1"
      + vgw_telemetry                  = (known after apply)
      + vpn_gateway_id                 = (known after apply)
    }

  # module.vpn.aws_vpn_connection.cx_2 will be created
  + resource "aws_vpn_connection" "cx_2" {
      + arn                            = (known after apply)
      + customer_gateway_configuration = (known after apply)
      + customer_gateway_id            = (known after apply)
      + id                             = (known after apply)
      + routes                         = (known after apply)
      + static_routes_only             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + tunnel1_address                = (known after apply)
      + tunnel1_bgp_asn                = (known after apply)
      + tunnel1_bgp_holdtime           = (known after apply)
      + tunnel1_cgw_inside_address     = (known after apply)
      + tunnel1_inside_cidr            = "169.254.10.12/30"
      + tunnel1_preshared_key          = (sensitive value)
      + tunnel1_vgw_inside_address     = (known after apply)
      + tunnel2_address                = (known after apply)
      + tunnel2_bgp_asn                = (known after apply)
      + tunnel2_bgp_holdtime           = (known after apply)
      + tunnel2_cgw_inside_address     = (known after apply)
      + tunnel2_inside_cidr            = "169.254.10.16/30"
      + tunnel2_preshared_key          = (sensitive value)
      + tunnel2_vgw_inside_address     = (known after apply)
      + type                           = "ipsec.1"
      + vgw_telemetry                  = (known after apply)
      + vpn_gateway_id                 = (known after apply)
    }

  # module.vpn.aws_vpn_gateway.vpn_gateway will be created
  + resource "aws_vpn_gateway" "vpn_gateway" {
      + amazon_side_asn = "65010"
      + arn             = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.vpn.google_compute_external_vpn_gateway.aws_gateway will be created
  + resource "google_compute_external_vpn_gateway" "aws_gateway" {
      + description     = "VPN gateway on AWS side"
      + id              = (known after apply)
      + name            = "aws-gateway"
      + project         = (known after apply)
      + redundancy_type = "FOUR_IPS_REDUNDANCY"
      + self_link       = (known after apply)

      + interface {
          + id         = 0
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 1
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 2
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 3
          + ip_address = (known after apply)
        }
    }

  # module.vpn.google_compute_ha_vpn_gateway.target_gateway will be created
  + resource "google_compute_ha_vpn_gateway" "target_gateway" {
      + id             = (known after apply)
      + name           = "vpn-to-aws"
      + network        = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # module.vpn.google_compute_router.main will be created
  + resource "google_compute_router" "main" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "router-main"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode = "DEFAULT"
          + asn            = 65020
        }
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_1 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_1" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-1"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha1"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_2 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_2" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-2"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha2"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_3 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_3" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-3"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha3"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_4 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_4" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-4"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha4"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_1 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-1"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_2 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_2" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-2"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-2"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_3 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_3" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-3"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-3"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_4 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_4" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-4"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-4"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_1 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_1" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha1"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 0
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 0
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_2 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_2" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha2"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 1
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 0
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_3 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_3" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha3"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 2
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 1
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_4 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_4" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha4"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 3
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 1
    }

Plan: 34 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: t.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "t.tfplan"

```

</details>

*Pusher: @rytswd, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform for Kubernetes Setup`*